[
    {
        "title": "ASSESSMENT OF CORPORATE SOCIAL RESPONSIBILITY DISCLOSURE ONRETURN ON ASSET AND SHARE PRICE OF SEPLAT ENERGY PLC IN NIGERIA",
        "author": "Olorunnisola Abiola Olubukola",
        "department": "Department of Business Administration",
        "university": " Kampala International University",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "Corporate social responsibility (CSR) is considered an instrument for improving a company's reputation with key stakeholders, generating revenue, and improving bottom-line results; however, rather than corporate organizations, most studies concentrated on Nigeria, a sovereign state. Therefore, it is imperative to investigate the specific relationship between corporate social responsibility disclosure and its effects on asset returns and share prices, with specific reference to an oil firm such as Seplat Energy Plc in Nigeria. Nigeria. Ex-post facto or causal comparative designs were utilized because the study's data came from the annual reports of Seplat Energy Plc on the Nigerian Stock Exchange. Pearson Product Moment Correlation (PPMC) and regression analysis were used to analyze this study. The results showed that corporate social responsibility indices are positively related to ROA, except size. Additionally, it was observed that the corporate social responsibility index explains 46.8% of the variance in ROA. Because the size and donation values on the t-calculated values of -1.089 and 0.620, respectively, are less than the t-tabulated value of 1.833. Based on the research findings, Seplat Petroleum Development Plc was found to have acknowledged the value of corporate social responsibility (CSR) and to be fulfilling its commitments to both internal and external stakeholders as well as the broader community. It was recommended that a law be enacted that will fix the minimum percentage of profit that organizations should spend on corporate social responsibility."
    },
    {
        "title": "DISTRIBUTION CHANNEL AND AGRIBUSINESS GROWTH OF SELECTED FIRMS IN JOS-NORTH LOCAL GOVERNMENT AREA, PLATEAU STATE",
        "author": "ADAMU Ishaya Nyam Usman",
        "department": "Department of Business Administration",
        "university": "Nasarawa State University",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "his study examined the effect of distribution channel on agribusiness growth in Jos-North Local Government Area, Plateau State. The population consisted of 146 producers, wholesalers, and retailers from nine purposively selected agribusinesses. A census approach was employed. Data was collected using a structured questionnaire based on a 5-point Likert scale. Partial Least Squares Structural Equation Modeling (PLS-SEM) was utilized to analyze the collected data and determine the relationships between the study's concepts. The findings of the study indicated that both Channel Coordination and Channel Intermediaries have a significant positive effect on Agribusiness growth. However, the study did not find sufficient evidence to support a significant relationship between Channel Relationship and Agribusiness Growth. Based on the study's results, it is recommended that agribusinesses in Jos-North Local Government Area focus on strengthening coordination efforts within their distribution channels and strategically engage intermediaries to optimize their growth potential. Additionally, continuous monitoring and evaluation of distribution channel performance, fostering collaboration among agribusiness stakeholders, and conducting further research on the relationship between channel relationships and agribusiness growth are suggested."
    },
    {
        "title": "EFFECT OF DEEP BLUE ECONOMY ON THE GROWTH OF SELECTED MARITIME COMPANIES IN SOUTH-SOUTH NIGERIA",
        "author": "CHUKWUDI, Chika Ethel",
        "department": "Department of Business Administration",
        "university": "Nasarawa State University",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "This study examined the effect of deep blue economy on the growth of selected maritime companies in south-south Nigeria. The study used the survey research design; the target population of this study was 384 senior and mid-level employees from eight (8) selected private maritime firms and expert offices actively operating within the Niger Delta region. This research study utilized a census sampling method to gather data from the entire population. The data for this study were collected with the aid of a well-structured 5-point Likert scale questionnaire and the reliability of this instrument was tested using Cronbach Alpha. Partial Least Square Structural Equation Modelling (PLS-SEM) was employed to test the hypotheses formulated of which the study found that marine biotechnology has a negative insignificant effect on the growth of selected maritime companies in south-south Nigeria. Ocean Tourism does not have a significant effect the growth of the selected maritime companies in South-South Nigeria. The study recommends that Maritime companies should reconsider their investment strategies in marine biotechnology. Instead of allocating substantial resources to this sector, companies should focus on improving the efficiency and innovation of their existing operations. Conducting a detailed cost-benefit analysis can help identify more profitable areas for investment within the blue economy. Maritime companies should collaborate with local governments and tourism boards to develop and promote comprehensive tourism packages. These packages should include infrastructure improvements, marketing campaigns, and partnerships with travel agencies to attract more tourists and increase the economic benefits from this sector."
    },
    {
        "title": "EFFECT OF DIGITAL MARKETING STRATEGIES ON CONSUMER BEHAVIOUR OF CLOTHING AND JEWELRY PRODUCTS IN ABUJA, FEDERAL CAPITAL TERRITORY",
        "author": "ONOJA, ThankGod Eleojo",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "This study investigates the effect of digital marketing proxied by online advertising and personalization marketing on consumerbuying behaviour of clothing and jewelry products in Abuja, FCT. A descriptive research design, data was collected through a structured 5-Likert scale questionnaire from a population of consumers of clothing and jewelry products in Abuja, FCT, witha sample size of 500. Utilizing Partial Least Squares Structural Equation Modeling (PLS-SEM) for data analysis, theresults of the findings indicate that both online advertising and personalization marketing have no significant influences onconsumer buying behaviour of clothing and jewelry products in Abuja, FCT. Based on these findings, recommendations areproposed that while online advertising did not demonstrate a significant direct effect on consumer buying behaviour in this study,it should not be entirely discounted as a digital marketing strategy. Businesses should explore ways to optimize their online advertising efforts, such as by targeting specific consumer segments, personalizing ad content, and integrating online advertising with other digital marketing channels."
    },
    {
        "title": "EFFECT OF ECONOMIC AND SOCIO-CULTURAL ENVIRONMENTAL FACTORS ON SMALL BUSINESS FAILURE IN NORTH CENTRAL NIGERIA",
        "author": "WAMBA, Nuhu Eyugu",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "The study investigated the effect of business environmental factors on small business failure in North Central States, Nigeria. Specifically, it examined the effect of economic factors as well as socio-cultural factors. The study utilized the survey method. A sample size of 201 was obtained using Taro Yamane’s formula from a population of four hundred and four (404) registered SBEs in North Central Nigeria. Structured questionnaire was used to obtain data from respondents. The analysis was based on 201 copies of returned questionnaire representing 100% response rate. Descriptive statistics, Correlation and OLS multiple regressions were used to analyze data. Findings revealed that economic factors have significant and positive effect with the failure of SBEs in North Central Nigeria and the socio-cultural factors have positive or negative relationship with the failure SBUs in North Central Nigeria. The study recommended that managers of SBEs and Government should understand and look into the dynamic nature of economic factors that pose unnecessary constraints on businesses in Nigeria. Specifically multiple tax system should be jettisoned, exchange rate stability should be pursued, and inflation rate and interest rate should be attended to. It also recommended that Government should continue to provide more tax incentives to small businesses in order to trigger more employment opportunity by creating jobs within the economy"
    },
    {
        "title": "NSUK Journal of Management Research and Development, Vol 9, Issue 3, Sept. 2024 103 Effect Of Growth Strategies On The Performance Of Small And Medium Scale Enterprises In North Central Nigeria",
        "author": "MOHAMMED, Kazeem Adekunle",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "This study investigates the effect of growth strategies on the performance of small and medium enterprises (SMEs) in some states North Central Nigeria (including FCT Abuja, Kogi, Nasarawa, and Niger States). SMEs in this region are vital for economic growth and employment but face challenges due to a lack of tailored growth strategies. The research objectives are to evaluates the effects of combing product development and market penetration strategies on SME performance. Utilizing a survey causal research design and data from 440 SMEs, analyzed using Partial Least Squares Structural Equation Modelling (PLS-SEM), the study finds that both product development and market penetration strategies significantly enhance SME performance, with market penetration having a stronger effect. The findings align with previous studies and suggest that SMEs should prioritize market penetration while also investing in product development. The study recommends that SMEs in North Central Nigeria should invest in and prioritize product development strategies to improve performance. Also, SMEs should focus on robust market penetration strategies to significantly boost their performance."
    },
    {
        "title": "EFFECT OF INTERACTIONAL JUSTICE ON THE PERFORMANCE OF SELECTED MANAUFACTURING COMPANIES IN ABUJA",
        "author": "ANDAH, Angbazo Ruth Ph.D",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "This study adopts a survey research design to examine the effect of interactional justice on the performance of selected manufacturing companies in Abuja. The population comprises 898 employees, with a sample size of 277 determined using Yamane's (1967) formula, augmented by 30% to distribute 360 questionnaires to ensure adequate responses. Data collection was conducted using a structured five-point Likert scale questionnaire, and the collected data was analyzed using Partial Least Squares Structural Equation Modeling (PLS-SEM) with SmartPLSv3. The findings indicate that both informational justice and interpersonal justice significantly and positively impact organizational performance, corroborating previous studies. Based on these findings, it is recommended that manufacturing companies in Abuja enhance informational justice by ensuring transparent and timely communication and foster interpersonal justice by promoting a respectful and fair work environment. Implementing these strategies can lead to improved employee performance and overall organizational success."
    },
    {
        "title": "Effect Of Market Innovation On Small And Medium Enterprises' Performance In Lafia, Nasarawa State",
        "author": "SANI, Zuwera Ede",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "The study addressed the critical issue of enhancing the performance of small and medium-sized enterprises (SMEs) in Lafia, asarawa State, through market innovation. Despite the recognized potential of SMEs to drive economic growth, many in this region struggled with growth and competitiveness, highlighting a need for innovative practices. The main objective of the study was to assess the impact of new product/service introduction (NPSI), technology adoption (TA), and start-up hubs (SUH) on the performance of SMEs in Lafia. To achieve this, the study employed a survey research design, targeting a population of 9,722 registered SMEs. A sample size of 384 SMEs was determined using Taro Yamane sampling techniques to ensure representativeness. Data were collected through structured questionnaires administered to the sampled SMEs. The collected data were analysed using Ordinal Logistic Regression (OLR) to determine the relationship between the independent variables (NPSI, TA, and SUH) and the dependent variable (SME performance). Descriptive statistics and hypothesis testing were also conducted to provide a comprehensive analysis. The findings revealed that all three components of market innovation had a positive and significant impact on SME performance. Specifically, new product/service introduction significantly enhanced SME growth and adaptability to market demands. Technology adoption was found to improve operational efficiency and competitive advantage, while engagement with start-up hubs provided essential resources and networking opportunities that further boosted SME performance. Based on these findings, several specific recommendations were made. It was suggested that SMEs should be supported in consistently introducing new products and services through partnerships that provide funding and resources for research and development. For technology adoption, increased access to affordable technological tools was recommended, facilitated by subsidies or tax incentives, along with robust infrastructure for internet connectivity and digital literacy programs. Lastly, to enhance the role of start-up hubs, investments in establishing and expanding these hubs were recommended, alongside programs connecting SMEs with successful entrepreneurs and industry experts for mentorship and support."
    },
    {
        "title": "EFFECT OF N-POWER PROGRAMME ON YOUTH MPOWERMENT IN BENUE STATE, NIGERIA",
        "author": "UKEAGU, Kenneth Nnamdi",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "The general objective of this study is to assess the impact of N-Power programme on youth empowerment in Benue State Nigeria. This study can be adequately framed within the context of the Empowerment Theory, Human Capital Theory and ustainable Livelihoods Approach as it theoretical framework while the social survey design was adopted as its methodology. Thus, thepulation of this study is 48,815. The beneficiaries were purposely sampled because of their participation and xperience with the programme been renders by the N-power programme using Multistage sampling technique and a sample ize of 400 was determine using Taro Yamane. After the data analysis, the research revealed that the N-Power Knowledge omponent has been effective in enhancing the employability and entrepreneurial skills of non-graduate youth in the technology nd creative industries in Benue State. The programme has provided youth with the skills and resources necessary to succeed in he competitive technology and creative sectors. Based on the above findings, the study suggests that since the programme has uccessfully enhanced skill development and capacity building for youth in the trades and crafts sector. To further strengthen its mpact, it is recommended that the government increases funding for training and apprenticeship programs, provides incentives or employers to hire programme graduates, and establishes partnerships with local and international businesses to increase job pportunities in the sector."
    },
    {
        "title": "EFFECT OF SELF AWARENESS AND SELF MANAGEMENT ON EMPLOYEES’ PERFORMANCE OF PRIVATE HOSPITALS IN NORTH CENTRAL NIGERIA",
        "author": "AKOLO, Markus Michael ",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "The healthcare industry in North Central Nigeria is confronts by a distinctive array of challenges impacting its employee’s performance. These challenges include limited healthcare resources and high patient volumes creating a demanding environment both physically and emotionally. This study therefore examines the effect of self-awareness and self-management on employee performance in private hospitals located in North Central Nigeria. A survey research design is employed, targeting 242 doctors and nurses from registered and insured private hospitals across the six states of North Central Nigeria and the Federal Capital Territory (FCT). Data is collected using structured questionnaires and analyzed using descriptive statistics and Partial Least Square Structural Equation Modeling (PLS-SEM). The findings indicate a positive but insignificant effect of self-awareness on employee performance. However, self-management demonstrates a significant positive effect on employee performance. The study concludes that while self-awareness may not have a statistically significant impact on employee performance in private hospitals in North Central Nigeria, it remains a valuable trait for healthcare professionals. On the other hand, self-management skills significantly enhance employee performance, emphasizing the importance of investing in programs to improve these skills among healthcare workers. Based on the findings, the study recommends implementation of training programs and workshops to enhance self-awareness and self-management skills among healthcare employees, utilizing tools such as self-assessment, mindfulness training, and stress management resources, aimed at improving overall performance and productivity."
    },
    {
        "title": "EFFECT OF SOCIAL AND ENVIRONMENTAL REPORTING ON THE FINANCIAL PERFORMANCE OF LISTED INDUSTRIAL GOODS FIRMS IN NIGERIA",
        "author": "ABDULLAHI, Zulqurnain Yusuf",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "The industrial goods sector is a critical component of Nigeria contributing significantly to economic growth and development. This study investigates the effect of environmental reporting and social reporting on the financial performance of listed industrial goods firms in Nigeria. The study population comprised all 13 listed industrial goods firms on the Nigerian Exchange Group during the 2018 to 2022 period, utilizing a census sampling technique. The study adopted an ex post facto descriptive research design, utilizing secondary data and panel data analysis techniques. Social reporting and environmental reporting do not have a statistically significant effect on the financial performance (return on assets). suggest the need for policymakers and industry leaders to better align these practices with investor preferences to enhance the sector's overall viability"
    },
    {
        "title": "EFFECT OF STRATEGIC INTELLIGENCE ON PERFORMANCE OF LISTED FIRMS ON THE NIGERIA EXCHANGE GROUP",
        "author": "YUSUF, Bushira Mohammed",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "Firms listed on the Nigerian Exchange Group encounter difficulties stemming from economic variables, which in turn causes a reduction in trading volume. This research examines the effect of strategic intelligence on the performance of listed firms on the Nigerian exchange group, utilizing a survey methodology. The study sample involved 111 participants, who are the CEOs from the 153 companies listed on the Nigerian exchange group ltd (NGX). The data was analyzed using Partial Least Square Structural Equation Modeling (PLS-SEM). The findings indicated a substantial positive effect between foresight and creativity on the performance of firms listed on the Nigerian Exchange Group Ltd (NGX), while intuition had a positive but insignificant effect. Based on these results, the study concludes that strategic intelligence is a powerful instrument for boosting organizational performance. It is recommended that the management of Nigerian-listed firms should integrate strategic intelligence, including foresight, intuition, and creativity, to optimize their organizations and enhance overall performance."
    },
    {
        "title": "EFFECT OF TALENT MANAGAEMENT PRACTICES ON PERFORMANCE OF SMALL AND MEDIUM ENTREPRISES IN NORTH CENTRAL NIGERIA",
        "author": "1IBRAHIM, Ahmed Abdullahi",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "The declining level of performance of SMEs in Nigeria is alarming and calls for a study of this nature which examined the effect of talent development and talent retention on performance of small and medium enterprises in North central, Nigeria. Survey design was adopted wherein data was collected using structured questionnaire from a sample of 406 registered SMEs selected using stratified random sampling technique from a total of 130,862 SMEs in north central Nigeria. Data collected were analyzed using ordinary least squares regression and the study found that talent development has a positive and significant effect on performance while talent retention revealed a negative and significant effect on performance. Therefore, the study recommends that SMEs should reserve specific portion of the finances to train their employees on relevant skills and knowledge through workshops and webinars in addition to encouraging and supporting a culture of continuous learning which could be fostered through job rotation. Also, it was recommended that SMEs should ensure that they provide their high-potential employees with competitive compensation and benefit that exceeds or equates that of the industry average in addition to charting a clear career path for their talents."
    },
    {
        "title": "EFFECT OF TRANSFORMATIONAL LEADERSHIP ON ORGANIZATIONAL RESILIENCE IN DEPOSIT MONEY BANKS IN NIGERIA",
        "author": "YUSUF, Isiaka Ayobami",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "This study examined the effect of two dimensions of transformational leadership - inspirational motivation and intellectual stimulation on organizational resilience in Nigerian deposit money banks. Employing a cross-sectional survey design with a quantitative approach using primary data and a structured five-point Likert scale questionnaire, data was collected using a simple random sampling technique for a sample size of 462(385 plus extra 20%) out of population of all employees on managerial cadre level of all the branches of 25 CBN registered deposit money banks in Abuja using Cochran (1963) formula for sample size determination. Partial Least Squares Structural Equation Modelling (PLS-SEM) was employed for data analysis of 394 usable sample, using Smart – PLS 4 tool to evaluate the research hypotheses. The study revealed that intellectual stimulation significantly and positively influences organizational resilience in Nigerian deposit money banks. Furthermore, inspirational motivation significantly and positively impacts on organizational resilience in Nigerian deposit money banks. Based on these findings, this study recommends that Nigerian deposit money banks should prioritize leadership development programs that cultivate intellectual stimulation and inspirational motivation skills among leaders as a key mechanism for  enhancing organizational resilience."
    },
    {
        "title": "EFFECT OF WORKPLACE DIVERSITY ON EMPLOYEES’ PERFORMANCE IN SELECTED DEPOSIT MONEY BANKS IN ABUJA",
        "author": "Prof. BARDE, Embugus Barnabas",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "This study investigates the effect of workplace diversity on employee performance in selected deposit money banks in Abuja, focusing on age and gender diversity employing a structured Likert scale questionnaire of five point with a sample size of 214 respondents. Utilizing SmartPLS-SEM for data analysis, the findings revealed that both age diversity (path coefficient = 0.290, T-value = 3.285, P-value = 0.001) and gender diversity (path coefficient = 0.561, T-value = 7.035, P-value = 0.000) have statistically significant positive effects on employee performance. Based on these results, the study recommends implementing age and gender diversity programs, providing diversity and inclusion training, promoting diverse leadership, and developing comprehensive diversity policies to enhance employee performance and achieve better organizational outcomes."
    },
    {
        "title": "INNOVATION-DRIVEN SUSTAINABILITY: EXAMINING THE EFFECTS OF PRODUCT AND PROCESS INNOVATIONS ON SMES IN THE DIGITAL ERA IN FCT ABUJA",
        "author": "UMARU, Jeremiah",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "Tis study examines the relationships between innovation (process and product) and the sustainability of small and medium enterprises (SMEs) in the digital era within the Federal Capital Territory (FCT) Abuja, Nigeria. Drawing on existing literature, the research hypothesizes that both process innovation and product innovation have a positive and significant impact on the sustainability of SMEs. The study employs a quantitative approach, utilizing a survey-based data collection method. A sample of 384 SMEs operating in the FCT Abuja region was analyzed using Partial Least Squares Structural Equation Modeling (PLS-SEM). The finding strongly shows that process innovation has a significant and positive effect on SME sustainability. In contrast, the study did not find a significant direct relationship between product innovation and SME sustainability. The study recommends that SME owners/managers, policymakers, and support institutions should prioritize investments and initiatives that foster process innovation capabilities within the SME sector."
    },
    {
        "title": "ORGANIZATIONAL CULTURE, ORGANIZATIONAL MEMORY AND PERFORMANCE OF SELECTED INFORMATION AND TECHNOLOGY FIRMS IN NIGERIA",
        "author": "ADAMU Abbas Audu",
        "department": "Department Of Business Administration,",
        "university": "Nasarawa State University,",
        "location": "./articles/article1.pdf",
        "volume": "Volume 1 2020",
        "image": "assets/img/article_cover.jpg",
        "abstract": "he inability of Nigerian Information Technology firms to expand operations and gain competitive advantage especially in the face of foreign competition has remained a thing of concern to many stakeholders and hence this research which examines the effect of organizational culture and organizational memory on the performance of selected IT firms in Nigeria. A structured five-point Likert scale questionnaire was used in a survey design to gather primary data from a sample of 464 IT firms who were selected by way of census sampling technique. Multiple regression analysis was used to analyze the data. The study found that organizational culture has positive and significant effect on performance while organizational memory has a negative significant effect on performance. The study therefore recommends that IT firms should foster open communication and obtain regular feedback from both employees and customers. In addition, they should intensify efforts towards recognizing individual and group accomplishment which aligns with their objective and reward hardworking and innovative employees. Similarly, it was also recommended that IT firms should develop and maintain centralized systems that are easily accessible to all employees which allows documentation of key processes & procedures, and technical solutions. In addition, they should encourage continuous learning by organizing trainings and workshops especially on customer relationship management so as to store client-specific knowledge."
    }
]